maintenance-api/app/controllers/logs_controller.rb

INSERT INTO "logs" ("service", "mileage", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["service", "oil change"], ["mileage", 5000], ["car_id", 3], ["created_at", "2020-11-19 16:59:41.975863"], ["updated_at", "2020-11-19 16:59:41.975863"]]
---
  def create
    @log = Log.new(log_params)

    if @log.save